Repository: kshashkina/ReFood
Catalog: apps/ios/ReFood/ReFood/Localizable.xcstrings
Source language: en
Languages: uk

# addProduct_barcode_label %@
source: Barcode: %@
uk: Штрих-код: %@

# addProduct_error_system
source: Our system cannot handle this input. Please check the fields and try again.
uk: Наша система не може обробити ці дані. Перевірте поля та спробуйте ще раз.

# addProduct_header_edit
source: Refine Product Data
uk: Оновити дані товару

# addProduct_header_new
source: Help the community
uk: Допоможи спільноті

# addProduct_header_subtitle
source: Fields in **bold** are required. Please be as accurate as possible.
uk: Поля, виділені **жирним**, є обов'язковими. Будьте максимально точними.

# addProduct_ingredients_desc
source: List ingredients separated by commas
uk: Перелічіть інгредієнти через кому

# addProduct_ingredients_title
source: Ingredients
uk: Інгредієнти

# addProduct_label_added_sugars
source: Added Sugars
uk: Доданий цукор

# addProduct_label_allergens
source: Allergens
uk: Алергени

# addProduct_label_brand
source: Brand
uk: Бренд

# addProduct_label_caffeine
source: Caffeine (mg)
uk: Кофеїн (мг)

# addProduct_label_carbs
source: Carbs
uk: Вуглеводи

# addProduct_label_categories
source: Categories
uk: Категорії

# addProduct_label_fats
source: Fats
uk: Жири

# addProduct_label_kcal
source: Kcal
uk: Ккал

# addProduct_label_material
source: Material
uk: Матеріал

# addProduct_label_name
source: Product Name
uk: Назва товару

# addProduct_label_proteins
source: Proteins
uk: Білки

# addProduct_label_quantity
source: Quantity
uk: Кількість

# addProduct_label_recycling_code
source: Recycling Code
uk: Код переробки

# addProduct_label_salt
source: Salt
uk: Сіль

# addProduct_label_sat_fat
source: Sat. Fat
uk: Насич. жири

# addProduct_label_shape
source: Shape
uk: Форма

# addProduct_label_sugars
source: Sugars
uk: Цукри

# addProduct_notice_edit
source: Updates will be processed by our system. Please re-scan the product in a few moments to see the changes.
uk: Оновлення будуть оброблені системою. Будь ласка, перескануйте товар за кілька хвилин, щоб побачити зміни.

# addProduct_notice_new
source: The new product will be added to our global database and will be available for all users after validation.
uk: Новий товар буде додано до нашої глобальної бази даних і стане доступним для всіх користувачів після перевірки.

# addProduct_notice_title
source: Important Notice
uk: Важливе зауваження

# addProduct_nutrition_title
source: Nutrition Facts (per 100g)
uk: Харчова цінність (на 100г)

# addProduct_packaging_desc
source: Use recycling codes (e.g. PAP 20, PET 01)
uk: Використовуйте коди переробки (напр. PAP 20)

# addProduct_packaging_title
source: Packaging
uk: Пакування

# addProduct_photo_analyzing
source: AI is analyzing...
uk: ШІ аналізує...

# addProduct_photo_capture
source: Tap to capture product
uk: Натисніть, щоб зробити фото

# addProduct_photo_no_image
source: No Image
uk: Немає фото

# addProduct_placeholder_allergens
source: e.g. Milk, Nuts
uk: напр. Молоко, Горіхи

# addProduct_placeholder_brand
source: e.g. Danone
uk: напр. Данон

# addProduct_placeholder_categories
source: Separated by comma
uk: Через кому

# addProduct_placeholder_name
source: e.g. Greek Yogurt
uk: напр. Грецький Йогурт

# addProduct_placeholder_quantity
source: Include units (e.g. 500g)
uk: З одиницями (напр. 500г)

# addProduct_save_edit
source: Save Changes
uk: Зберегти зміни

# addProduct_save_new
source: Save to Database
uk: Зберегти в базу

# addProduct_step1_desc_edit
source: You can keep the current photo or take a new one to update it.
uk: Ви можете залишити поточне фото або зробити нове, щоб оновити його.

# addProduct_step1_desc_new
source: Please take a photo first. While you fill in the details, our AI will validate the product in the background.
uk: Будь ласка, спочатку зробіть фото. Поки ви заповнюєте деталі, наш ШІ перевірить товар у фоновому режимі.

# addProduct_step1_title_edit
source: Step 1: Update Photo (Optional)
uk: Крок 1: Оновити фото (опційно)

# addProduct_step1_title_new
source: Step 1: Take a Photo
uk: Крок 1: Зробити фото

# addProduct_step2_desc
source: Fill out the remaining details below to complete the product entry.
uk: Заповніть решту деталей нижче, щоб завершити додавання товару.

# addProduct_step2_title
source: Step 2: Product Details
uk: Крок 2: Деталі товару

# addProduct_title_edit
source: Edit Product
uk: Редагувати товар

# addProduct_title_new
source: New Product
uk: Новий товар

# common_done
source: Done
uk: Готово

# common_got_it
source: Got it
uk: Зрозуміло

# common_unknown
source: Unknown
uk: Невідомо

# comparison_ai_description
source: Get detailed AI comparison analysis and personalized recommendations
uk: Отримайте детальний AI-аналіз порівняння та персоналізовані рекомендації

# comparison_ai_error_message
source: Sorry, an unexpected error happened while analyzing products
uk: Вибачте, виникла неочікувана помилка під час аналізу продуктів.

# comparison_ai_error_title
source: Error Occurred
uk: Сталася помилка

# comparison_ai_insight
source: AI Insight
uk: AI Аналіз

# comparison_ai_loading
source: AI is analyzing data...
uk: AI аналізує дані...

# comparison_generate_analysis
source: Generate analysis
uk: Згенерувати аналіз

# comparison_key_differences
source: Key Differences
uk: Ключові відмінності

# comparison_nutrient_calories
source: Calories
uk: Калорії

# comparison_nutrient_carbs
source: Carbohydrates
uk: Вуглеводи

# comparison_nutrient_fat
source: Fat
uk: Жири

# comparison_nutrient_protein
source: Protein
uk: Білки

# comparison_nutrient_salt
source: Salt
uk: Сіль

# comparison_nutrient_saturated_fat
source: Saturated fat
uk: Насичені жири

# comparison_nutrient_sugar
source: Sugar
uk: Цукор

# comparison_retry_button
source: Retry
uk: Спробувати ще раз

# comparison_section_grades
source: Quality Grades
uk: Оцінка якості

# comparison_section_nutrition
source: Nutrition Facts (per 100g)
uk: Харчова цінність (на 100г)

# comparison_title
source: Product Comparison
uk: Порівняння продуктів

# details_ai_analysis_title
source: AI Analysis
uk: AI Аналіз

# details_allergens_empty
source: No allergens listed
uk: Алергени не вказані

# details_allergens_title
source: Allergens
uk: Алергени

# details_barcode %@
source: Barcode: %@
uk: Штрихкод: %@

# details_compare_btn
source: Compare with another product
uk: Порівняти з іншим продуктом

# details_ingredients_empty
source: No ingredients data
uk: Дані про інгредієнти відсутні

# details_ingredients_title
source: Ingredients
uk: Інгредієнти

# details_nutri_calories
source: Calories
uk: Калорії

# details_nutri_carbs
source: Carbohydrates
uk: Вуглеводи

# details_nutri_fat
source: Fat
uk: Жири

# details_nutri_protein
source: Protein
uk: Білки

# details_nutri_salt
source: Salt
uk: Сіль

# details_nutri_sat_fat
source: Saturated fat
uk: Насичені жири

# details_nutri_sugar
source: Sugar
uk: Цукор

# details_nutrition_title
source: Nutrition facts
uk: Харчова цінність

# details_packaging_empty
source: No packaging data
uk: Дані про пакування відсутні

# details_packaging_sort_btn
source: How to sort
uk: Як сортувати

# details_packaging_title
source: Packaging
uk: Пакування

# details_tab_100g
source: Per 100g
uk: На 100г

# details_tab_serving
source: Per serving
uk: На порцію

# filter_all
source: All
uk: Всі

# filter_animal_waste
source: Animal Waste
uk: Тваринні відходи

# filter_asbestos
source: Asbestos
uk: Азбест

# filter_bags
source: Bags
uk: Пакети

# filter_batteries
source: Batteries
uk: Батарейки

# filter_beverage_cartons
source: Beverage Cartons
uk: Тетрапак

# filter_cans
source: Cans
uk: Бляшанки

# filter_cardboard
source: Cardboard
uk: Картон

# filter_cartons
source: Cartons
uk: Тетрапак

# filter_clothes
source: Clothes
uk: Одяг

# filter_clothing
source: Clothing
uk: Одяг

# filter_cooking_oil
source: Cooking Oil
uk: Рослинна олія

# filter_drugs
source: Drugs / Medication
uk: Ліки

# filter_electrical_items
source: Electrical Items
uk: Електроприлади

# filter_engine_oil
source: Engine Oil
uk: Машинне мастило

# filter_fluorescent_tubes
source: Fluorescent Tubes
uk: Люмінесцентні лампи

# filter_glass
source: Glass
uk: Скло

# filter_glass_bottles
source: Glass Bottles
uk: Скляні пляшки

# filter_glass_jars
source: Glass Jars
uk: Скляні банки

# filter_green_waste
source: Green Waste
uk: Садові відходи

# filter_ink_cartridges
source: Ink Cartridges
uk: Картриджі

# filter_low_energy_bulbs
source: Low Energy Bulbs
uk: Енергозберігаючі лампи

# filter_magazines
source: Magazines
uk: Журнали

# filter_metal
source: Metal
uk: Метал

# filter_mobile_phones
source: Mobile Phones
uk: Мобільні телефони

# filter_newspaper
source: Newspapers
uk: Газети

# filter_organic
source: Organic Waste
uk: Органіка

# filter_paint
source: Paint
uk: Фарба

# filter_paper
source: Paper
uk: Папір

# filter_paper_packaging
source: Paper Packaging
uk: Паперове пакування

# filter_pet
source: PET Plastic
uk: ПЕТ пластик

# filter_pet_drink_bottles
source: PET Bottles
uk: ПЕТ пляшки

# filter_plastic
source: Plastic
uk: Пластик

# filter_plastic_bottle_caps
source: Plastic Caps
uk: Пластикові кришечки

# filter_plastic_bottles
source: Plastic Bottles
uk: Пластикові пляшки

# filter_plastic_packaging
source: Plastic Packaging
uk: Пластикове пакування

# filter_pmd
source: PMD
uk: Пластик та Метал

# filter_scrap_metal
source: Scrap Metal
uk: Металобрухт

# filter_shoes
source: Shoes
uk: Взуття

# filter_thermometers
source: Thermometers
uk: Термометри

# filter_tyres
source: Tyres
uk: Автомобільні шини

# filter_wood
source: Wood
uk: Деревина

# grade_average
source: Average
uk: Середньо

# grade_eco_friendly
source: Eco-friendly
uk: Екологічно

# grade_excellent
source: Excellent
uk: Відмінно

# grade_good
source: Good quality
uk: Хороша якість

# grade_low
source: Low
uk: Низький рівень

# grade_moderate
source: Moderate
uk: Помірно

# grade_not_great
source: Not great
uk: Посередньо

# grade_poor
source: Poor
uk: Погано

# grade_unknown
source: Unknown
uk: Невідомо

# location_modal_btn_settings
source: Go to Settings
uk: Перейти до Налаштувань

# location_modal_desc
source: To see recycling points, please enable location access in Settings
uk: Щоб побачити пункти переробки, будь ласка, увімкніть доступ до геолокації в Налаштуваннях

# location_modal_title
source: Location Access
uk: Доступ до геолокації

# manualInput_button_find
source: Find Product
uk: Знайти продукт

# manualInput_label_barcode
source: Barcode
uk: Штрих-код

# manualInput_subtitle
source: Enter the product barcode manually
uk: Введіть штрих-код продукту вручну

# manualInput_tip_length
source: Barcode is usually 7–14 digits.
uk: Штрих-код зазвичай має 7–14 цифр.

# manualInput_title
source: Manual Input
uk: Ручне введення

# map_btn_search_area
source: Search in this area
uk: Шукати в цій зоні

# map_default_point_name
source: Recycling Point
uk: Пункт переробки

# map_get_route_title
source: Get Route:
uk: Побудувати маршрут:

# map_lbl_searching
source: Searching...
uk: Пошук...

# map_sheet_materials
source: Accepted Materials:
uk: Приймають матеріали:

# map_title
source: Recycling Points
uk: Пункти переробки

# network_error_desc
source: Please check your network settings and try again. We need the internet to fetch product data.
uk: Будь ласка, перевірте налаштування мережі та спробуйте ще раз. Нам потрібен інтернет для отримання даних про продукт.

# network_error_title
source: No Internet Connection
uk: Немає підключення

# preview_btn_compare
source: Compare with %@
uk: Порівняти з %@

# preview_btn_continue
source: Yes, continue
uk: Так, продовжити

# preview_btn_scan_again
source: Scan again
uk: Сканувати ще раз

# preview_confirm_subtitle
source: Please make sure this is the item you were looking for
uk: Будь ласка, переконайтеся, що це саме той продукт, який ви шукали

# preview_confirm_title
source: Is this the correct product?
uk: Це правильний продукт?

# preview_previous_item
source: previous item
uk: попереднім

# recycling_empty_state
source: No packaging data available
uk: Дані про пакування відсутні

# recycling_find_point_button
source: Find recycling point
uk: Знайти пункт прийому

# recycling_how_to_prepare
source: How to prepare:
uk: Як підготувати:

# recycling_packaging_element
source: Packaging Element
uk: Елемент пакування

# recycling_title
source: Recycling Instructions
uk: Інструкції з сортування

# recycling_type_glass
source: Glass
uk: Скло

# recycling_type_metal
source: Metal
uk: Метал

# recycling_type_mixed
source: Mixed Waste
uk: Змішані відходи

# recycling_type_organic
source: Organic
uk: Органіка

# recycling_type_paper
source: Paper & Cardboard
uk: Папір та картон

# recycling_type_plastic
source: Plastic
uk: Пластик

# recycling_unknown_material
source: Unknown Material
uk: Невідомий матеріал

# recycling_waste_types
source: Waste Types
uk: Типи відходів

# route_dist_km
source: %.1f km
uk: %.1f км

# route_dist_m
source: %d m
uk: %d м

# route_mode_bicycle
source: Bike
uk: Вело

# route_mode_drive
source: Drive
uk: Авто

# route_mode_walk
source: Walk
uk: Пішки

# route_time_h_m
source: %d h %d min
uk: %d год %d хв

# route_time_m
source: %d min
uk: %d хв

# scanner_btn_manual
source: Enter barcode manually
uk: Ввести штрихкод вручну

# scanner_btn_scan
source: Scan
uk: Сканувати

# scanner_hint_subtitle
source: Position the barcode inside the frame
uk: Розташуйте штрихкод усередині рамки

# scanner_hint_title
source: Point your camera at the barcode
uk: Наведіть камеру на штрихкод

# scanner_title
source: Scanning
uk: Сканування

# sheet_btn_add
source: Add product to the database
uk: Додати продукт до бази

# sheet_btn_try_again
source: Try Again
uk: Спробувати знову

# sheet_btn_view
source: View Product
uk: Переглянути продукт

# sheet_error_sub
source: Could not find your product in the database
uk: Не вдалося знайти ваш продукт у базі даних

# sheet_error_title
source: Search error
uk: Помилка пошуку

# sheet_fail_desc
source: This product has not yet been added to our database. You can try again or enter the information manually.
uk: Цей продукт ще не додано до нашої бази даних. Ви можете спробувати ще раз або ввести інформацію вручну.

# sheet_fail_title
source: Product not found
uk: Продукт не знайдено

# sheet_lbl_error
source: Error
uk: Помилка

# sheet_lbl_found
source: Found
uk: Знайдено

# sheet_lbl_ready
source: Ready
uk: Готово

# sheet_lbl_start
source: Start
uk: Початок

# sheet_looking
source: Looking for your product...
uk: Шукаємо ваш продукт...

# sheet_step_process_sub
source: Preparing information about your product...
uk: Підготовка інформації про ваш продукт...

# sheet_step_process_title
source: Product found
uk: Продукт знайдено

# sheet_step_ready_sub
source: All information has been successfully loaded
uk: Усю інформацію успішно завантажено

# sheet_step_ready_title
source: Product ready!
uk: Продукт готовий!

# sheet_step_search_sub
source: Searching for your product in the database...
uk: Шукаємо ваш продукт у базі даних...

# sheet_step_search_title
source: Starting search...
uk: Починаємо пошук...
